
<!-- terraform-plan-prod -->
### 🌍 Terraform Plan – **PROD**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-078be621992112a4b]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0bafc647e85f0ab16]
module.eks.aws_iam_role.node_role: Refreshing state... [id=prod-eks-node-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=prod-eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=prod-eks-node-role-20260121050941821500000001]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=prod-eks-node-role-20260121050941918700000002]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=prod-eks-node-role-20260121050941944500000003]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=prod-eks-cluster-role-20260121050942085800000004]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-095f6810236e7e9d7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05fb3def09c464106]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00593c8a47b71a4aa]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09d17b8ae7bc82ca6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-03eb6702333a803f3]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d9283fe132b2d636]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c75fc751446b42eb]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0e18f40698da8772c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0ab9d060bd58da1b8]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0407452ebb5f095c0]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-0065e2816e0c04ac0]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0e2daca1c6aef9a28]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0cbdc67881208dc48]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-043b22d5011016712]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0d320798f7dc7fa97]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-08189cb619646f181]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-605234311]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:prod-eks-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map_v1.aws_auth will be created
  + resource "kubernetes_config_map_v1" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::358871393576:role/github-actions-terraform-role"
                  "username": "platform-admin"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0407452ebb5f095c0"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0e18f40698da8772c"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0e18f40698da8772c"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "prod-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
